const aboutUs = document.querySelector(".about-us__text");
const closeBtn = document.querySelector(".about-company__close-btn h4");
const dropDown = document.querySelector(".drop-down");
const maxstring = 240;
aboutUs.textContent = `
شرکت داده گسترعصرنوین از سال 1382 به عنوان یکی از شرکت های ارائه دهنده خدمات
انتقال داده (PAP) آغاز بـه کار نموده است. در سال 1388 مالکیت این شرکت به بخش
خصوصی واگذار شد و در سال 1391 نام تجاری «های وب» را در بازار مخابرات و ارتباطات
کشور معرفی نمود و با ارائه سرویس در بیش از 543 شهر در سال 1395 توسط سازمان تنظیم
مقررات و ارتباطات رادیویی به عنوان یکی از شرکت های برتر انتخاب گردید. در طی دوره
فعالیت، این شرکت توانست به سرعت در بازار رقـابتی خدمات دستـرسی به دیتـا و
اینترنت رشد نماید، که در همین راستا با شرکت های برتری همچون پارس ارتباطات،
پارسان لین ارتباطات، پارسان لین، رامیلا، آواسل، رهکام، پردازش عصر افق و هیرکانیا
ادغام گشته و فعالیت خود را توسعه بخشید.
`;
aboutUs.textContent = `${aboutUs.textContent.substring(0, maxstring)} 
${aboutUs.textContent.length > maxstring ? "..." : aboutUs}
`;
closeBtn.addEventListener("click", () => {
  if (dropDown.classList.contains("active") === true) {
    aboutUs.textContent = `${aboutUs.textContent.substring(0, maxstring)} 
        ${aboutUs.textContent.length > maxstring ? "..." : aboutUs}
        `;
    closeBtn.textContent = "توضیحات بیشتر";
  } else {
    aboutUs.textContent = `
    شرکت داده گسترعصرنوین از سال 1382 به عنوان یکی از شرکت های ارائه دهنده خدمات
    انتقال داده (PAP) آغاز بـه کار نموده است. در سال 1388 مالکیت این شرکت به بخش
    خصوصی واگذار شد و در سال 1391 نام تجاری «های وب» را در بازار مخابرات و ارتباطات
    کشور معرفی نمود و با ارائه سرویس در بیش از 543 شهر در سال 1395 توسط سازمان تنظیم
    مقررات و ارتباطات رادیویی به عنوان یکی از شرکت های برتر انتخاب گردید. در طی دوره
    فعالیت، این شرکت توانست به سرعت در بازار رقـابتی خدمات دستـرسی به دیتـا و
    اینترنت رشد نماید، که در همین راستا با شرکت های برتری همچون پارس ارتباطات،
    پارسان لین ارتباطات، پارسان لین، رامیلا، آواسل، رهکام، پردازش عصر افق و هیرکانیا
    ادغام گشته و فعالیت خود را توسعه بخشید.
    `;
    closeBtn.textContent = "بستن";
  }
  dropDown.classList.toggle("active");
});
