const aboutUs = document.querySelector(".about-us__text");
const closeBtn = document.querySelector(".about-company__close-btn h4");
const dropDown = document.querySelector(".drop-down");
const maxstring = 240;
aboutUs.textContent = `
شرکت کروز از بدو پیدایش خود در سال 1361 تاکنون، استراتژی مشخصی را به
عنوان مبنای کار خود در نظر داشته است: تامین قطعات و سیستم های با
کیفیت و مطمئن جهت بر آورده کردن نیازهای صنایع کشور، همگام با استفاده
از فرصتهای موجود جهت نفوذ به بازارهای صادراتی خارجی. به عنوان
بزرگترین شرکت تولید کننده قطعات خودرو کشور، این وظیفه ماست که کیفیت
و قابلیتهای خودرو های تولید شده در ایران را بهبود دهیم. جهت نیل به
این هدف، ما بطور مستمر پروژه ها و فعالیتهای جدیدی را در دستور کار
خود قرار می دهیم تا بتوانیم رانندگی را به تجربه ای لذت بخش و ایمن
برای همه خریداران خودرو تبدیل کنیم. ما بواسطه ارتباطات تجاری و فنی
رو به گسترش خود با بزرگترین شرکتهای تولید کننده قطعات خودرو در جهان،
می توانیم با استفاده از فن آوری های نوین، محصولات نوآورانه خود را
جهت ایجاد ارزش افزوده برای مشتریانمان با بهترین قیمت عرضه کنیم.
مهمترین ارزشهای سازمانی شرکت کروز عبارتند از: صداقت، خلاقیت، سخت
کوشی و اخلاق و بواسطه آنها، ما برآنیم که کیفیت زندگی کارکنان مان،
جایگاه رقابتی شرکت مان و توان فنی صنعت خودرو ایران را به سطح بالاتری
ارتقاء دهیم.
`;
aboutUs.textContent = `${aboutUs.textContent.substring(0, maxstring)} 
${aboutUs.textContent.length > maxstring ? "..." : aboutUs}
`;
closeBtn.addEventListener("click", () => {
  if (dropDown.classList.contains("active") === true) {
    aboutUs.textContent = `${aboutUs.textContent.substring(0, maxstring)} 
        ${aboutUs.textContent.length > maxstring ? "..." : aboutUs}
        `;
    closeBtn.textContent = "توضیحات بیشتر";
  } else {
    aboutUs.textContent = `
    شرکت کروز از بدو پیدایش خود در سال 1361 تاکنون، استراتژی مشخصی را به
    عنوان مبنای کار خود در نظر داشته است: تامین قطعات و سیستم های با
    کیفیت و مطمئن جهت بر آورده کردن نیازهای صنایع کشور، همگام با استفاده
    از فرصتهای موجود جهت نفوذ به بازارهای صادراتی خارجی. به عنوان
    بزرگترین شرکت تولید کننده قطعات خودرو کشور، این وظیفه ماست که کیفیت
    و قابلیتهای خودرو های تولید شده در ایران را بهبود دهیم. جهت نیل به
    این هدف، ما بطور مستمر پروژه ها و فعالیتهای جدیدی را در دستور کار
    خود قرار می دهیم تا بتوانیم رانندگی را به تجربه ای لذت بخش و ایمن
    برای همه خریداران خودرو تبدیل کنیم. ما بواسطه ارتباطات تجاری و فنی
    رو به گسترش خود با بزرگترین شرکتهای تولید کننده قطعات خودرو در جهان،
    می توانیم با استفاده از فن آوری های نوین، محصولات نوآورانه خود را
    جهت ایجاد ارزش افزوده برای مشتریانمان با بهترین قیمت عرضه کنیم.
    مهمترین ارزشهای سازمانی شرکت کروز عبارتند از: صداقت، خلاقیت، سخت
    کوشی و اخلاق و بواسطه آنها، ما برآنیم که کیفیت زندگی کارکنان مان،
    جایگاه رقابتی شرکت مان و توان فنی صنعت خودرو ایران را به سطح بالاتری
    ارتقاء دهیم.
    `;
    closeBtn.textContent = "بستن";
  }
  dropDown.classList.toggle("active");
});
